Backend/app/controllers/exercises_controller.rb

    def index
        render json: Exercise.all
---
SELECT "exercises".* FROM "exercises"