Backend/app/controllers/workouts_controller.rb

    def index

        render json: Workout.all, methods: [ :exercises ]
---
SELECT "workouts".* FROM "workouts"