Backend/app/controllers/api/v1/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
        def index
            render json: Exercise.all