Backend/app/controllers/api/v1/stats_controller.rb

        def index
            render json: Stat.all
---
SELECT "stats".* FROM "stats"