Backend/app/controllers/api/v1/workouts_controller.rb

        def create
            workout = Workout.create(workout_params)
---
INSERT INTO "workouts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Full Body"], ["created_at", "2019-01-24 17:21:06.432609"], ["updated_at", "2019-01-24 17:21:06.432609"]]

        def index
            render json: Workout.all
---
SELECT "workouts".* FROM "workouts"

        def destroy
            current_workout.destroy
---
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 15]]

        def define_current_workout
            if params[:id]
                @current_workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]